package com.nts_ed.day06.example005;

public class Example005 {

	public static void main(String[] args) {
		// TODO 自動生成されたメソッド・スタブ
		for (int i = 100; i < 1000; i++) {
			int a = i % 10;
			int b = i / 10 % 10;
			int c = i / 100;
			if (a * a * a + b * b * b + c * c * c == i) {
				// ナルシシスト数を表示 
				System.out.println(i);
			}
		}
	}

}

/*
2.for繰り返し文
2.5練習問題for繰り返し文練習‐ナルシシスト数

問題要求：ターミナルですべてのナルシシスト数を出力する

ナルシシスト数とは？
①３桁の数値
	Ex:111 222 333 370 371 520 999
②ナルシシスト数の個位、十位、百位の立法合計と元の数値と等しい
	123 →1³+2³+3³=1+8+27=36≠123 	ナルシシスト数ではない
	371 →3³+7³+1³=27+343+1=371=371  ナルシシスト数!!!
	
①3桁の個位はどうやって出す？
	371 1は371を剰余演算の結果   371 % 10 = 1
②3桁の百位はどうやって出す？
	371 3は371を除算の結果(整数) 371 / 10 = 3
③3桁の十位はどうやって出す？
	371 371を10の結果で、7を個位に移動する(整数)  371 / 10 = 3
				37を10の剰余演算で7を取得できる   37 % 10 = 7
										371 / 10% 10 = 7
④考え:任意数値の指定桁はどうやって出す？
	先に除算である数値を個位に移動、次は剰余演算で最終位の値を取得
	1234567 先に除算で10000を割り1234を取得、次は10を剰余演算で5を取得
	

ナルシシスト数問題について分析
①すべての３桁の数値を受け入れ、最小３桁の数値:100、最大999、for繰り返し文を使い、結果を受け取る
	for (int i = 100; i < 1000; i++) {・・・}

②３桁の数値すべてナルシシスト数ではないため、判定を行い、条件が満たせるもののみを出力
		if(条件式) {・・・}

③判定条件は３桁の数値の各数値を受け取り、立法合計を産出してからiとおなじかどうかを判定
		if(?+?+?==元の数値) {元の数値を出力}

④３桁の数値の各市の値を出す
	int a = 元の数値の個位;
	int b = 元の数値の十位;
	int c = 元の数値の百位;
	if(a*a*a+b*b*b+c*c*c i==元の数値) {
		元の数値を出力}
	}
	
	System.out.println("1-100の間の合計:" + sum );

分析のまとめ：
①繰り返し作業を作成
②条件が満たせるかどうかを判定
③個、十、百位の各桁の値を取得

*/




